micgur01/mbed-os/features/FEATURE_BLE/targets/TARGET_STM/TARGET_STM32WB/HCIDriver.cpp
/*
 * Copyright (c) 2019 ARM Limited
 * Copyright (c) 2019 STMicroelectronics
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <stdio.h>
#include "ble/blecommon.h"
#include "CordioBLE.h"
#include "CordioHCIDriver.h"
#include "CordioHCITransportDriver.h"
#include "mbed.h"
#include "hci_api.h"
#include "hci_cmd.h"
#include "hci_core.h"
#include "dm_api.h"
#include "bstream.h"
#include "hci_mbed_os_adaptation.h"
#include "mbed_trace.h"

/* STM32WB include files */
#include "stm32wbxx_ll_ipcc.h"
#include "stm32wbxx_ll_system.h"
#include "tl.h"
#include "shci.h"
#include "shci_tl.h"
#include "hw.h"
#include "app_conf.h"
#include "otp.h"

/* mbed trace feature is supported */
/* ex in mbed_app.json */
/*   "mbed-trace.enable": "1" */
#define TRACE_GROUP "BLWB"

/******************************************************************************
 * BLE config parameters
 ******************************************************************************/
/*  Defined from WB Cube reference SW */
#define CFG_TLBLE_EVT_QUEUE_LENGTH 5
#define CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE 255   /**< Set to 255 with the memory manager and the mailbox */
#define TL_BLE_EVENT_FRAME_SIZE ( TL_EVT_HDR_SIZE + CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE )
#define POOL_SIZE (CFG_TLBLE_EVT_QUEUE_LENGTH*4*DIVC(( sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE ), 4))

#define CONFIG_DATA_PUBADDR_OFFSET          (0x00) /**< Bluetooth public address */
#define CONFIG_DATA_PUBADDR_LEN             (6)

/* HCI related defines */
#define HCI_RESET_RAND_CNT        4
#define VENDOR_SPECIFIC_EVENT     0xFF
#define ACI_HAL_SET_TX_POWER_LEVEL 0xFC0F
#define ACI_WRITE_CONFIG_DATA_OPCODE 0xFC0C
#define ACI_READ_CONFIG_DATA_OPCODE 0xFC0D
#define MAX_HCI_ACL_PACKET_SIZE (sizeof(TL_PacketHeader_t) + 5 + 251)
#define MAX_HACI_EVT_SIZE (255+5)

/* mbed_trace: debug traces (tr_debug) can be disabled here with no change in mbed_app.json */
// #undef TRACE_LEVEL_DEBUG
// #define TRACE_LEVEL_DEBUG 0

/* tr_debug : add data content in console print */
#define PRINT_HCI_DATA 0

/******************************************************************************
 * BLE config parameters
 ******************************************************************************/
static void evt_received(TL_EvtPacket_t *hcievt);
static void syscmd_status_not(SHCI_TL_CmdStatus_t status);
static void sysevt_received(void *pdata);
static void acl_data_ack(void);
static bool acl_data_wait(void);
static void init_debug(void);
static bool get_bd_address(uint8_t *bd_addr);
static bool sysevt_wait(void);
static bool sysevt_check(void);

int handle_ready_event = 0;

namespace ble {
namespace vendor {
namespace stm32wb {

/**
 * stm32wb HCI driver implementation
 * @see cordio::CordioHCIDriver
 */
class HCIDriver : public cordio::CordioHCIDriver {
public:
    /**
     * Construction of the HCIDriver.
     * @param transport: Transport of the HCI commands.
     * @param rst: Name of the reset pin
     */
    HCIDriver(
        cordio::CordioHCITransportDriver &transport_driver
    ) : cordio::CordioHCIDriver(transport_driver) { }

    virtual cordio::buf_pool_desc_t get_buffer_pool_description();
    /**
     * @see CordioHCIDriver::do_initialize
     */
    virtual void do_initialize()
    {
        // Nothig needed, init is only at transpot layer level
    }

    /**
     * @see CordioHCIDriver::do_terminate
     */
    virtual void do_terminate()
    {
        // Nothig needed, init is only at transpot layer level
    }

    /**
    * @see CordioHCIDriver::start_reset_sequence
    */
    virtual void start_reset_sequence()
    {
        /* send an HCI Reset command to start the sequence */
        HciResetCmd();
    }

    static uint8_t convert_db_to_tx_power_index(int8_t level_db) {
        const int8_t conversion[] = {
            -40, -21, -20, -19,
            -18, -16, -15, -14,
            -13, -12, -11, -10,
             -9,  -8,  -7,  -6,
             -5,  -4,  -3,  -2,
             -1,  -1,  -1,  -1,
              0,   0,   1,   2,
              3,   4,   5,   6
        };

        uint8_t index;
        for (index = 0; index < sizeof(conversion); ++index) {
            if (level_db <= conversion[index]) {
                break;
            }
        }
        return index;
    }

    virtual ble_error_t set_tx_power(int8_t level_db) {


        uint8_t buf[2];
        buf[0] = 0x1; // Enable high power mode - deprecated and ignored on STM32WB
        buf[1] = convert_db_to_tx_power_index(level_db);

        HciVendorSpecificCmd(ACI_HAL_SET_TX_POWER_LEVEL, 2, buf);

        return BLE_ERROR_NONE;
    }

    /**
     * @see CordioHCIDriver::handle_reset_sequence
     */
    virtual void handle_reset_sequence(uint8_t *pMsg)
    {
        uint16_t       opcode;
        static uint8_t randCnt;

        /* if event is a command complete event */
        if (*pMsg == HCI_CMD_CMPL_EVT) {
            tr_debug("Command Complete Event Command");
#if (PRINT_HCI_DATA)
            for (uint8_t i = 0; i < 20; i++) {
                tr_debug("  %02X", *((uint8_t *)pMsg + i));
            }
#endif
            /* parse parameters */
            tr_debug("  HCI_EVT_HDR_LEN=%d", HCI_EVT_HDR_LEN);
            pMsg += HCI_EVT_HDR_LEN;
            pMsg++;                   /* skip num packets */
            BSTREAM_TO_UINT16(opcode, pMsg);
            pMsg++;                   /* skip status */

            /* decode opcode */
            tr_debug("  opcode = %#06x", opcode);
            switch (opcode) {
                case HCI_OPCODE_RESET:
                    /* initialize rand command count */
                    randCnt = 0;
                    tr_info("WB Reset Received");
                    /* Once reset complete evet is received we need
                     * to send a few more commands:
                     * Tx power and set bd addr
                     */
                    if (get_bd_address(bd_addr)) {
                        aciWriteConfigData(CONFIG_DATA_PUBADDR_OFFSET, bd_addr);
                        tr_info("Setting Bdaddr: %02x:%02x:%02x:%02x:%02x:%02x",
                                bd_addr[0],
                                bd_addr[1],
                                bd_addr[2],
                                bd_addr[3],
                                bd_addr[4],
                                bd_addr[5]);
                    } else {
                        tr_info("could not find BDaddr");
                        /*  Skip to next step */
                        set_tx_power(MBED_CONF_CORDIO_PREFERRED_TX_POWER);
                    }
                    break;

