micgur01/mbed-os/features/FEATURE_BLE/targets/TARGET_STM/TARGET_STM32WB/HCIDriver.cpp
                case ACI_WRITE_CONFIG_DATA_OPCODE:
                    tr_debug("Bluetooth Device address set");
                    /* set the event mask to control which events are generated by the
                     * controller for the host */
                    set_tx_power(MBED_CONF_CORDIO_PREFERRED_TX_POWER);
                    break;


                case ACI_HAL_SET_TX_POWER_LEVEL:
                    tr_debug("Tx Power Level set");
                    //signal_reset_sequence_done();
                    HciSetEventMaskCmd((uint8_t *) hciEventMask);
                    break;

                case HCI_OPCODE_SET_EVENT_MASK:
                    // set the event mask to control which LE events are generated by
                    // the controller for the host
                    HciLeSetEventMaskCmd((uint8_t *) hciLeEventMask);
                    break;

                case HCI_OPCODE_LE_SET_EVENT_MASK:
                    /* below command is not supported */
#if COMMAND_NOT_SUPPORTED_SKIP_STEP
                    // set the event mask to control which events are generated by the
                    // controller for the host (2nd page of flags )
                    HciSetEventMaskPage2Cmd((uint8_t *) hciEventMaskPage2);
                    break;

                case HCI_OPCODE_SET_EVENT_MASK_PAGE2:
#endif
                    // Ask the Bluetooth address of the controller
                    HciReadBdAddrCmd();
                    break;

                case HCI_OPCODE_READ_BD_ADDR:
                    // Store the Bluetooth address in the stack runtime parameter
                    BdaCpy(hciCoreCb.bdAddr, pMsg);
                    // Read the size of the buffer of the controller
                    HciLeReadBufSizeCmd();
                    break;

                case HCI_OPCODE_LE_READ_BUF_SIZE:
                    // Store the buffer parameters in the stack runtime parameters
                    BSTREAM_TO_UINT16(hciCoreCb.bufSize, pMsg);
                    BSTREAM_TO_UINT8(hciCoreCb.numBufs, pMsg);
                    /* initialize ACL buffer accounting */
                    hciCoreCb.availBufs = hciCoreCb.numBufs;
                    // read the states and state combinations supported by the link
                    // layer of the controller
                    HciLeReadSupStatesCmd();
                    break;

                case HCI_OPCODE_LE_READ_SUP_STATES:
                    // store supported state and combination in the runtime parameters
                    // of the stack
                    memcpy(hciCoreCb.leStates, pMsg, HCI_LE_STATES_LEN);
                    // read the total of whitelist entries that can be stored in the
                    // controller.
                    HciLeReadWhiteListSizeCmd();
                    break;

                case HCI_OPCODE_LE_READ_WHITE_LIST_SIZE:
                    // store the number of whitelist entries in the stack runtime
                    // parameters
                    BSTREAM_TO_UINT8(hciCoreCb.whiteListSize, pMsg);

                    // Read the LE features supported by the controller
                    HciLeReadLocalSupFeatCmd();
                    break;

                case HCI_OPCODE_LE_READ_LOCAL_SUP_FEAT:
                    // Store the set of LE features supported by the controller
                    BSTREAM_TO_UINT16(hciCoreCb.leSupFeat, pMsg);
                    // read the total number of address translation entries which can be
                    // stored in the controller resolving list.
                    hciCoreReadResolvingListSize();
                    break;

                case HCI_OPCODE_LE_READ_RES_LIST_SIZE:
                    // store the number of address translation entries in the stack
                    // runtime parameter
                    BSTREAM_TO_UINT8(hciCoreCb.resListSize, pMsg);

                    // read the Controller's maximum supported payload octets and packet
                    // duration times for transmission and reception
                    hciCoreReadMaxDataLen();
                    break;

                case HCI_OPCODE_LE_READ_MAX_DATA_LEN: {
                    // store payload definition in the runtime stack parameters.
                    uint16_t maxTxOctets;
                    uint16_t maxTxTime;

                    BSTREAM_TO_UINT16(maxTxOctets, pMsg);
                    BSTREAM_TO_UINT16(maxTxTime, pMsg);

                    /* use Controller's maximum supported payload octets and packet duration times
                    * for transmission as Host's suggested values for maximum transmission number
                    * of payload octets and maximum packet transmission time for new connections.
                    */
                    HciLeWriteDefDataLen(maxTxOctets, maxTxTime);
                }
                break;

                case HCI_OPCODE_LE_WRITE_DEF_DATA_LEN:
                    if (hciCoreCb.extResetSeq) {
                        HciReadLocalVerInfoCmd();
                    } else {
                        /* initialize extended parameters */
                        hciCoreCb.maxAdvDataLen = 0;
                        hciCoreCb.numSupAdvSets = 0;
                        hciCoreCb.perAdvListSize = 0;
                        /* send next command in sequence */
                        HciLeRandCmd();
                    }
                    break;

                case HCI_OPCODE_READ_LOCAL_VER_INFO:
                case HCI_OPCODE_LE_READ_MAX_ADV_DATA_LEN:
                case HCI_OPCODE_LE_READ_NUM_SUP_ADV_SETS:
                case HCI_OPCODE_LE_READ_PER_ADV_LIST_SIZE:
                    // handle extended command
                    if (hciCoreCb.extResetSeq) {
                        /* send next extended command in sequence */
                        (*hciCoreCb.extResetSeq)(pMsg, opcode);
                    }
                    break;

                case HCI_OPCODE_LE_RAND:
                    /* check if need to send second rand command */
                    if (randCnt < (HCI_RESET_RAND_CNT - 1)) {
                        randCnt++;
                        HciLeRandCmd();
                    } else {
                        uint8_t addr[6] = { 0 };
                        memcpy(addr, pMsg, sizeof(addr));
                        DM_RAND_ADDR_SET(addr, DM_RAND_ADDR_STATIC);
                        // note: will invoke set rand address
                        set_random_static_address(addr);
                    }
                    break;

                case HCI_OPCODE_LE_SET_RAND_ADDR:
                    /* send next command in sequence */
                    signal_reset_sequence_done();
                    break;

                default:
                    tr_info("Complete Event in reset seq with unknown opcode =0x%4X", opcode);
                    break;
            }
        } else if (*pMsg == HCI_CMD_STATUS_EVT) {
            uint8_t status;
            /* get status */
            /* parse parameters */
            pMsg += HCI_EVT_HDR_LEN;
            status = *pMsg;
            pMsg++;
            pMsg++;                   /* skip num packets */
            BSTREAM_TO_UINT16(opcode, pMsg);
            tr_info("Command Status event, status:%d, opcode=0x%4X", status, opcode);
        } else {
            /**
             * vendor specific event
             */
            if (pMsg[0] == VENDOR_SPECIFIC_EVENT) {
                /* parse parameters */
                pMsg += HCI_EVT_HDR_LEN;
                BSTREAM_TO_UINT16(opcode, pMsg);
                tr_debug("Vendor specific event, opcode=0x%4X", opcode);
            } else {
                tr_info("Unknown event %d!", pMsg[0]);
            }
        }
    }

