micgur01/mbed-os/features/FEATURE_BLE/targets/TARGET_STM/TARGET_STM32WB/HCIDriver.cpp
    p_sys_event = (TL_AsynchEvt_t*)(((tSHCI_UserEvtRxParam*)pPayload)->pckt->evtserial.evt.payload);
    
    switch(p_sys_event->subevtcode)
    {
        case SHCI_SUB_EVT_CODE_READY:
        ((tSHCI_UserEvtRxParam*)pPayload)->status = APPE_SysevtReadyProcessing( (SHCI_C2_Ready_Evt_t*)p_sys_event->payload );
        break;

        default:
        break;
    }
    /* For now only READY event is received, so we know this is it */
    sys_event_sem.release();
    /* But later on ... we'll have to parse the answer */
    return;
}

/*  returns true if ssyevt was received, false otherwise */
static bool sysevt_wait(void)
{
    /*  Wait for 10sec max - if not return an error */
    if (!sys_event_sem.try_acquire_for(10000)) {
        return false;
    } else {
        /*  release immmediately, now that M0 runs */
        sys_event_sem.release();
        return true;
    }
}

/*  returns true if ssyevt was already received, which means M0 core is
 *  already up and running */
static bool sysevt_check(void)
{
    /*  Check if system is UP and runing already */
    if (!sys_event_sem.try_acquire_for(10)) {
        return false;
    } else {
        /*  release immmediately as M0 already runs */
        sys_event_sem.release();
        return true;
    }
}

static void syscmd_status_not(SHCI_TL_CmdStatus_t status)
{
    tr_debug("syscmd_status_not, status:%d", status);
    return;
}

void shci_notify_asynch_evt(void *pdata)
{
    /* Need to parse data in future version */
    shci_user_evt_proc();
    return;
}

void shci_cmd_resp_release(uint32_t flag)
{
    sys_resp_sem.release();
    return;
}

void shci_cmd_resp_wait(uint32_t timeout)
{
    /* TO DO: manage timeouts if we can return an error */
    if (!sys_resp_sem.try_acquire_for(timeout)) {
        tr_error("shci_cmd_resp_wait timed out");
    }
}

void shci_register_io_bus(tSHciIO *fops)
{
    /* Register IO bus services */
    fops->Init    = TL_SYS_Init;
    fops->Send    = TL_SYS_SendCmd;
}

/**
 * Few utilities functions
 */
static void init_debug(void)
{
    /* In case of MBED debug profile, configure debugger support */
#if (defined(MBED_DEBUG) || (CFG_DEBUGGER_SUPPORTED == 1))
    tr_info("init_debug ENABLED");
    /**
     * Keep debugger enabled while in any low power mode
     */
    HAL_DBGMCU_EnableDBGSleepMode();
    HAL_DBGMCU_EnableDBGStopMode();
    HAL_DBGMCU_EnableDBGStandbyMode();

    /***************** ENABLE DEBUGGER *************************************/
    LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);
    LL_C2_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);

#else
    tr_info("init_debug DISABLED");

    GPIO_InitTypeDef gpio_config = {0};

    gpio_config.Pull = GPIO_NOPULL;
    gpio_config.Mode = GPIO_MODE_ANALOG;

    gpio_config.Pin = GPIO_PIN_15 | GPIO_PIN_14 | GPIO_PIN_13;
    __HAL_RCC_GPIOA_CLK_ENABLE();
    HAL_GPIO_Init(GPIOA, &gpio_config);

    gpio_config.Pin = GPIO_PIN_4 | GPIO_PIN_3;
    __HAL_RCC_GPIOB_CLK_ENABLE();
    HAL_GPIO_Init(GPIOB, &gpio_config);

    HAL_DBGMCU_DisableDBGSleepMode();
    HAL_DBGMCU_DisableDBGStopMode();
    HAL_DBGMCU_DisableDBGStandbyMode();

#endif /* (CFG_DEBUGGER_SUPPORTED == 1) */

    return;
}

/* This function fills in a BD address table */
bool get_bd_address(uint8_t *bd_addr)
{
    uint8_t *otp_addr;
    uint32_t udn;
    uint32_t company_id;
    uint32_t device_id;
    bool bd_found;

    udn = LL_FLASH_GetUDN();

    if (udn != 0xFFFFFFFF) {
        tr_info("Found Unique Device Number: %#06x", udn);

        company_id = LL_FLASH_GetSTCompanyID();
        device_id = LL_FLASH_GetDeviceID();

        bd_addr[0] = (uint8_t)(udn & 0x000000FF);
        bd_addr[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
        bd_addr[2] = (uint8_t)((udn & 0x00FF0000) >> 16);
        bd_addr[3] = (uint8_t)device_id;
        bd_addr[4] = (uint8_t)(company_id & 0x000000FF);
        bd_addr[5] = (uint8_t)((company_id & 0x0000FF00) >> 8);

        bd_found = true;
    } else {
        otp_addr = OTP_Read(0);
        if (otp_addr) {
            memcpy(bd_addr, ((OTP_ID0_t *)otp_addr)->bd_address, CONFIG_DATA_PUBADDR_LEN);
            bd_found = false;
        } else {
            tr_debug("Cannot find Bluetooth Device ADDRESS to program - will leave hw default");
            bd_found = true;
        }
    }

    return bd_found;
}

